solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_mmu.h
/*
 * Copyright 2023-2024 NXP
 *
 * All rights reserved.
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_MMU_H_
#define FSL_MMU_H_

#include "fsl_common.h"

/*!
 * @addtogroup mmu
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*!@{*/
/*! @brief mmu driver version 2.0.0. */
#define FSL_MMU_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*!@}*/

/*!
 * @brief The enumeration of MMU status flags, @anchor mmu_status_flags_t.
 */
enum _mmu_status_flags
{
    kMMU_BusyFlag       = MMU_STS_BUSY_MASK, /*!< MMU is in Busy state, wait for it to clear before taking action. */
    kMMU_LUTInvalidFlag = MMU_STS_LUT_INVALID_MASK,      /*!< Indicate whether the valid bit in the access address is 0,
                                                         which means the access operation is invalid in LUT. */
    kMMU_AddressInvalidFlag = MMU_STS_INVALID_ADDR_MASK, /*!< The AHB access address is out
                                                            of the valid address range. */
    kMMU_ParityErrorFlag  = MMU_STS_PARITY_ERROR_MASK,   /*!< A parity error is detected in the access address. */
    kMMU_LockErrorFlag    = MMU_STS_LOCK_ERROR_MASK,     /*!< A lock error is detected when writing to LUT SRAM. */
    kMMU_IpsReadErrorFlag = MMU_STS_IPS_READ_ERROR_MASK, /*!< Indicate whether an IPS read error is detected when
                                                     read LUT SRAM, including IPS read parity error and
                                                     read-verify mismatch error. */

    kMMU_AllFlags = MMU_STS_BUSY_MASK | MMU_STS_LUT_INVALID_MASK | MMU_STS_INVALID_ADDR_MASK |
                    MMU_STS_PARITY_ERROR_MASK | MMU_STS_LOCK_ERROR_MASK |
                    MMU_STS_IPS_READ_ERROR_MASK, /*!< All flags. */
};

/*!
 * @brief The enumeration of MMU interrupts, @anchor mmu_interrupt_enable_t.
 *
 */
enum _mmu_interrupt_enable
{
    kMMU_LUTInvalidInterruptEnable = MMU_INTEN_LUT_INVALID_EN_MASK,      /*!< Enable the interrupt
                                                                         for #kMMU_LUTInvalidFlag. */
    kMMU_AddressInvalidInterruptEnable = MMU_INTEN_INVALID_ADDR_EN_MASK, /*!< Enable the interrupt
                                                                        for #kMMU_AddressInvalidFlag. */
    kMMU_ParityErrorInterruptEnable = MMU_INTEN_PARITY_ERROR_EN_MASK,    /*!< Enable the interrupt
                                                                           for #kMMU_ParityErrorFlag. */
    kMMU_LockErrorInterruptEnable = MMU_INTEN_LOCK_ERROR_EN_MASK, /*!< Enable the interrupt for #kMMU_LockErrorFlag. */
    kMMU_IpsReadErrorInterruptEnable = MMU_INTEN_IPS_READ_ERROR_EN_MASK, /*!< Enable the interrupt
                                                                        for #kMMU_IpsReadErrorFlag. */

    kMMU_AllInterruptsEnable = MMU_INTEN_LUT_INVALID_EN_MASK | MMU_INTEN_INVALID_ADDR_EN_MASK |
                               MMU_INTEN_PARITY_ERROR_EN_MASK | MMU_INTEN_LOCK_ERROR_EN_MASK |
                               MMU_INTEN_IPS_READ_ERROR_EN_MASK, /*!< Enable all interrupts. */
};

/*!
 * @brief The enumeration of unit size, available selections are 4KB, 8KB, 16KB, 32KB, and 64KB.
 */
typedef enum _mmu_unit_size
{
    kMMU_UnitSize4KB = 0U, /*!< Specify the basic size of unit is 4KB. */
    kMMU_UnitSize8KB,      /*!< Specify the basic size of unit is 8KB. */
    kMMU_UnitSize16KB,     /*!< Specify the basic size of unit is 16KB. */
    kMMU_UnitSize32KB,     /*!< Specify the basic size of unit is 32KB. */
    kMMU_UnitSize64KB,     /*!< Specify the basic size of unit is 64KB. */
} mmu_unit_size_t;
#define MMU_NUM_OF_UNIT_SIZE (5U)
extern mmu_unit_size_t g_selectedUnitSize;

/*!
 * @brief The enumeration of AHB access type, available selections are read access and write access.
 */
typedef enum _mmu_ahb_access_type
{
    kMMU_ReadAccess = 0UL, /*!< The access type of the AHB transfer is read. */
    kMMU_WriteAccess,      /*!< The access type of the AHB transfer is write. */
} mmu_ahb_access_type_t;

/*!
 * @brief The enumeration of error type in case of AHB transfer, available selections are LUT invalid error, address
 * invalid error, and parity error.
 */
typedef enum _mmu_ahb_error_type
{
    kMMU_LUTInvalidError  = 0x1UL, /*!< The error type information of the transfer is LUT invalid error. */
    kMMU_AddrInvalidError = 0x2UL, /*!< The error type information of the transfer is address invalid error. */
    kMMU_ParityError      = 0x4UL, /*!< The error type information of the transfer is parity error. */
} mmu_ahb_error_type_t;

#define MMU_PAGE_OPT_MASK (0xE0UL)
#define MMU_PAGE_OPT_SHIFT (5U)
#define MMU_PAGE_OPT(x)   (((uint32_t)(((uint32_t)(x)) << MMU_PAGE_OPT_SHIFT)) & MMU_PAGE_OPT_MASK)
/*!
 * @brief The MMU module supports two different page mode: 1 page mode and 4 pages mode.
 *
 * @note In 4 pages mode, each page contains 2K word. Different page can contain different mapping schema.
 */
typedef enum _mmu_page_option
{
    kMMU_PageOpt_1Page = 0U, /*!< MMU takes LUT SRAM as 1 page for address remapping. */
    kMMU_PageOpt_4Page_Low2KWordSelected = 1U,      /*!< MMU takes LUT SRAM as 4 pages for address remapping,
                                                 in this page mode the whole LUT is divided into 4 pages,
                                                 use LUT SRAM low 2K words for address remapping. */
    kMMU_PageOpt_4Page_MidLow2KWordSelected = 3U,      /*!< MMU takes LUT SRAM as 4 pages for address remapping,
                                            in this page mode the whole LUT is divided into 4 pages,
                                            use LUT SRAM mid-low 2K words for address remapping. */
    kMMU_PageOpt_4Page_MidHigh2KWordSelected = 5U,      /*!< MMU takes LUT SRAM as 4 pages for address remapping,
                                            in this page mode the whole LUT is divided into 4 pages,
                                            use LUT SRAM mid-high 2K words for address remapping. */
    kMMU_PageOpt_4Page_High2KWordSelected = 7U,      /*!< MMU takes LUT SRAM as 4 pages for address remapping,
                                            in this page mode the whole LUT is divided into 4 pages,
                                            use LUT SRAM mid-low 2K words for address remapping. */
} mmu_page_option_t;
extern mmu_page_option_t g_selectedPageOpt;

/*!
 * @brief The enumeration of LUT SRAM write operation, both burst-write and single-write are supported.
 */
typedef enum _mmu_lut_write_operation
{
    kMMU_LUTSingleWrite = 0U, /*!< In this operation, words to write in consequent LUT pointer may not consequent.
                                   It is possible to write discontinuous value into discontinuous address. */
    kMMU_LUTBurstWrite,       /*!< In this operation, words to write in consequence LUT pointer must be consequent.
                                  write continuous value into continuous address. */
} mmu_lut_write_operation_t;

/*!
 * @brief The behavior when an invalid address is detected is programmable.
 */
typedef enum _mmu_invalid_address_mode
{
    kMMU_InvalidAddrRespondError = 0U, /*!< MMU responds with a transfer error when a invalid address is detected. */
    kMMU_InvalidAddrAllowed,           /*!< MMU allows transfer when an invalid address is detected. */
} mmu_invalid_address_mode_t;

/*!
 * @brief The record of AHB information when an error happens.
 */
typedef struct _mmu_ahb_error_record
{
    uint32_t masterId : 8U;                /*!< Indicate the master ID of the transfer. */
    uint32_t protectionInfo : 7U;          /*!< Indicate the protection information of the transfer. */
    mmu_ahb_access_type_t accessType : 1U; /*!< Indicate the access type of the transfer. */
    mmu_ahb_error_type_t errorType : 3U;    /*!< Indicate the error type of the transfer. */
    uint32_t reserved : 13U;               /* Reserved. */
    uint32_t failAddr;                     /*!< Indicates the LUT address where an erro happens. */
} mmu_ahb_error_record_t;

/*!
 * @brief The word in LUT SRAM, there are 8K words exist in LUT SRAM.
 */
typedef struct _mmu_lut_word
{
    uint16_t mappedValue : 15U; /*!< The mapped value to set, should be index of unit in valid address range not
                                   specific AHB address. */
    uint16_t valid : 1U;        /*!< Specify whether the mapped value is valid: 1b1 means valid, 1b0 means invalid. */
} mmu_lut_word_t;

/*!
 * @brief The structure used to initialize the MMU instance includes unit size, page mode, address range, and LUT
 * content.
 */
typedef struct _mmu_config
{
    mmu_unit_size_t unitSize;                   /*!< Specify the basic size of unit that is used in the memory map. */

